import Vue from 'vue';
import VueI18n from 'vue-i18n';

Vue.use(VueI18n);

export const i18n = new VueI18n({
    locale: 'ua',
    fallbackLocale: 'ua',
    messages: {
        ua: {
            support: 'Потрібна допомога?',
            serviceRegistration: 'Реєстрація сервісу',
            tradeOfferTitle: 'Заявка на обмін',
            notification: 'Будь ласка, надавайте достовірні дані',
            chooseShop: 'Оберіть магазин',
            servicerFio: 'ПІБ співробітника',
            servicerNumber: 'Номер телефону співробітника',
            date: 'Дата придбання',
            orderNumber: 'Номер замовлення',
            customerFio: 'ПІБ покупця',
            customerNumber: 'Номер телефону покупця',
            smartphoneModel: 'Модель смартфону',
            complectation: 'Комплектація',
            smartphonePrice: 'Вартість смартфону',
            printRegFile: 'Роздрукувати пам\'ятку користувача',
            finalRegCheck: 'Я підтверджую, що клієнт ознайомлений з умовами сервісу',
            nextBtn: 'Далі',
            registerService: 'Зареєструвати сервіс',
            imeiWarning: 'Даний IMEI вже зареєстровано',
            validationError: 'Будь ласка, перевірте правильність заповнення усіх полів та натисніть кнопку',

            // trade
            notificationTrade: 'Будь ласка, введіть уважно IMEI',
            titleStep1: 'Пошук пристрою',
            titleStep2: 'Виконання умов обміну',
            titleStep3: 'Перевірка пристрою виконана',
            titleStep4: 'Обмін на сертифікати',
            checkbox1: 'Наявність розрахункового документу або копії на придбання пристрою та сервісу',
            checkbox2: 'Гарантійний талон з печаткою',
            checkbox3: 'Повна комплектація пристрою (з коробкою)',
            checkbox4: 'Копії сторінок паспорту та ІПН',

            checkbox5: 'IMEI перевірено',
            checkbox6: 'Зовнішній та технічний вигляд відповідає умовам обміну',
            checkbox7: 'Здійснено вихід з усіх аккаунтів, всі паролі та блокування зняті',
            checkbox8: 'Видалена особиста інформація, здійснено скидання до заводських налаштувань',

            descr1: 'Опис пункту 1',
            descr2: 'Опис пункту 2',
            descr3: 'Опис пункту 3',
            descr4: 'Опис пункту 4',

            checkbox9: 'Договор міни та Акт прийому-передачі',
            checkbox10: 'Роздрукувати заяву на укладнання Договору провести обмін',
            checkbox11: 'Я підтверджую, що всі умови обміну дотримані',
            makeTrade: 'Провести обмін',
            garanty: 'Залишилось днів гарантії:',
            successfulAdd: 'Сервіс успішно додано',
            successfulEdit: 'Обмін проведено успішно'
            
        },
        ru: {
            support: 'Нужна помощь?',
            serviceRegistration: 'Регистрация сервиса',
            tradeOfferTitle: 'Заявка на обмен',
            notification: 'Пожалуйста, предоставляйте достоверные данные',
            chooseShop: 'Выберите магазин',
            servicerFio: 'ФИО сотрудника',
            servicerNumber: 'Номер телефона сотрудника',
            date: 'Дата приобретения',
            orderNumber: 'Номер заказа',
            customerFio: 'ФИО покупателя',
            customerNumber: 'Номер телефона покупателя',
            smartphoneModel: 'Модель смартфона',
            complectation: 'Комплектация',
            smartphonePrice: 'Стоимость смартфона',
            printRegFile: 'Распечатать руководство пользователя',
            finalRegCheck: 'Я подтверждаю, что клиент ознакомлен с условиями сервиса',
            nextBtn: 'Дальше',
            registerService: 'Зарегистрировать сервис',
            imeiWarning: 'Данный IMEI уже был зарегистрирован',
            validationError: 'Пожалуйста, проверьте правильность заполнения полей и нажмите кнопку',

            notificationTrade: 'Пожалуйста, введите IMEI',
            titleStep1: 'Поиск устройства',
            titleStep2: 'Исполнение условий обмена',
            titleStep3: 'Проверка устройства выполнена',
            titleStep4: 'Обмен на сертификаты',
            checkbox1: 'Наличие расчётного документа или копии на приобретение устройства и сервиса',
            checkbox2: 'Гарантийный талон с печаткой',
            checkbox3: 'Полная комплектация устройства (с коробкой)',
            checkbox4: 'Копии страничек пасспорта и ИНН',

            checkbox5: 'IMEI проверено',
            checkbox6: 'Внешний и технический вид соответствует условиям обмена',
            checkbox7: 'Выполнено выход со всех аккаунтов, все пароли и блокировки сняты',
            checkbox8: 'Удалена личная информация, выполнен сброс до заводских настроек',

            descr1: 'Описание пункта 1',
            descr2: 'Описание пункта 2',
            descr3: 'Описание пункта 3',
            descr4: 'Описание пункта 4',

            checkbox9: 'Договор мены и Акт приема-передачи',
            checkbox10: 'Распечатать заявление на составление Договора провести обмен',
            checkbox11: 'Я подтверждаю, что все условия обмена выполнены',
            makeTrade: 'Провести обмен',
            garanty: 'Осталось дней гарантии:',
            successfulAdd: 'Сервис успешно добавлено',
            successfulEdit: 'Обмен успешно проведён'

        }
    }
})